t21/Walnut_X/Packages/.cache/Keil.LPC1700_DFP.2.2.0.pdsc
      <!-- *************************  Device 'LPC1768'  ***************************** -->
      <device Dname="LPC1768">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
      <!-- *************************  Device 'LPC1769'  ***************************** -->
      <device Dname="LPC1769">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC177x'  **************************** -->
      <subFamily DsubFamily="LPC177x">
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="MPSerial"      n="3"                           name="SSP"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
      
      <!-- *************************  Device 'LPC1774'  ***************************** -->
      <device Dname="LPC1774">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC177x Data Sheet"/>
        <feature type="IOs"           n="109"/>
        <feature type="USART"         n="4"/>
      </device>
      
      <!-- *************************  Device 'LPC1776'  ***************************** -->
      <device Dname="LPC1776">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC177x Data Sheet"/>
        <feature type="IOs"           n="141"/>
        <feature type="USART"         n="5"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
      <!-- *************************  Device 'LPC1777'  ***************************** -->
      <device Dname="LPC1777">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC177x Data Sheet"/>
        <feature type="IOs"           n="165"/>
        <feature type="USART"         n="5"/>
      </device>
      
      <!-- *************************  Device 'LPC1778'  ***************************** -->
      <device Dname="LPC1778">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC177x Data Sheet"/>
        <feature type="IOs"           n="165"/>
        <feature type="USART"         n="5"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC178x'  **************************** -->
      <subFamily DsubFamily="LPC178x">
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="165"/>
        <feature type="MPSerial"      n="3"                           name="SSP"/>
        <feature type="USART"         n="5"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
      
      <!-- *************************  Device 'LPC1785'  ***************************** -->
      <device Dname="LPC1785">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC178x Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'LPC1786'  ***************************** -->
      <device Dname="LPC1786">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC178x Data Sheet"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
      <!-- *************************  Device 'LPC1787'  ***************************** -->
      <device Dname="LPC1787">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD/LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents/LPC178X_7X.pdf"                 title="LPC178x Data Sheet"/>
      </device>
      
