t21/Walnut_X/Packages/.cache/Keil.LPC1700_DFP.2.2.0.pdsc
    <condition id="LPC17xx Ethernet">
      <description>NXP LPC17xx with Ethernet Controller</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1764"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1767"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
      <accept Dname="LPC1776"/>
      <accept Dname="LPC1778"/>
      <accept Dname="LPC1786"/>
      <accept Dname="LPC1788"/>
    </condition>

    <condition id="LPC17xx USBD">
      <description>NXP LPC1700 with  Device Controller</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <accept Dname="LPC1751"/>
      <accept Dname="LPC1752"/>
      <accept Dname="LPC1754"/>
      <accept Dname="LPC1756"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1759"/>
      <accept Dname="LPC1764"/>
      <accept Dname="LPC1765"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
      <accept Dname="LPC1774"/>
      <accept Dname="LPC1776"/>
      <accept Dname="LPC1777"/>
      <accept Dname="LPC1778"/>
      <accept Dname="LPC1785"/>
      <accept Dname="LPC1786"/>
      <accept Dname="LPC1787"/>
      <accept Dname="LPC1788"/>
    </condition>

    <condition id="LPC17xx USBH">
      <description>NXP LPC17xx with Host Controller</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <accept Dname="LPC1754"/>
      <accept Dname="LPC1756"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1759"/>
      <accept Dname="LPC1765"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
      <accept Dname="LPC1776"/>
      <accept Dname="LPC1777"/>
      <accept Dname="LPC1778"/>
      <accept Dname="LPC1785"/>
      <accept Dname="LPC1786"/>
      <accept Dname="LPC1787"/>
      <accept Dname="LPC1788"/>
    </condition>

  </conditions>

  <examples>
    <!-- MCB1700 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1700/Blinky">
      <description>Blinky example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Blinky ULp" doc="Abstract.txt" folder="Boards/Keil/MCB1700/Blinky_ULp">
      <description>Blinky ULINKpro example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB1700/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="Boards/Keil/MCB1700/Demo">
      <description>Demo example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>
 
    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Keil/MCB1700/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards/Keil/MCB1700/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="CAN Data" doc="Abstract.txt" folder="Boards/Keil/MCB1700/Middleware/CAN/CAN_Data">
      <description>CAN example that sends and receives data messages</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="CAN_Data.uvprojx"/>
      </project>
      <attributes>
        <category>Middleware</category>
        <category>CAN</category>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="Boards/Keil/MCB1700/Middleware/USB/Device/HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and joystick.</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

