t21/Walnut_X/Packages/.cache/Keil.LPC1700_DFP.2.2.0.pdsc
    <example name="BSD Server" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/BSD_Server" version="1.0.1">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/FTP_Server" version="1.0.0">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Server" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/HTTP_Server" version="1.0.1">
      <description>Compact Web Server with CGI interface</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/SMTP_Client" version="1.0.0">
      <description>Example showing how to compose and send emails</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/Network/Telnet_Server" version="1.0.1">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards/Embedded Artists/LPC1788-32 Developers Kit/Middleware/FileSystem/File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card) and format each drive</description>
      <board name="LPC1788-32 Developers Kit" vendor="Embedded Artists"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>
    
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC17xx CMSIS Device ARMCC">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC1700 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC17XX      /* Device Startup for NXP17XX */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>

        <!-- header files -->
        <file category="header" condition="LPC175x" name="Device/Include/LPC17xx.h"/>
        <file category="header" condition="LPC176x" name="Device/Include/LPC17xx.h"/>
        <file category="header" condition="LPC177x" name="Device/Include/LPC177x_8x.h"/>
        <file category="header" condition="LPC178x" name="Device/Include/LPC177x_8x.h"/>

        <!-- startup files -->
        <file category="source" condition="LPC175x" name="Device/Source/ARM/startup_LPC17xx.s"      attr="config" version="1.0.0"/>
        <file category="source" condition="LPC176x" name="Device/Source/ARM/startup_LPC17xx.s"      attr="config" version="1.0.0"/>
        <file category="source" condition="LPC177x" name="Device/Source/ARM/startup_LPC177x_8x.s"   attr="config" version="1.0.0"/>
        <file category="source" condition="LPC178x" name="Device/Source/ARM/startup_LPC177x_8x.s"   attr="config" version="1.0.0"/>

        <!-- system file -->
        <file category="source" condition="LPC175x" name="Device/Source/system_LPC17xx.c"           attr="config" version="1.0.0"/>
        <file category="source" condition="LPC176x" name="Device/Source/system_LPC17xx.c"           attr="config" version="1.0.0"/>
        <file category="source" condition="LPC177x" name="Device/Source/system_LPC177x_8x.c"        attr="config" version="1.0.0"/>
        <file category="source" condition="LPC178x" name="Device/Source/system_LPC177x_8x.c"        attr="config" version="1.0.0"/>

