t21/Walnut_X/Packages/.cache/Keil.LPC1700_DFP.2.2.0.pdsc
      <component Cgroup="LED" Capiversion="1.00" condition="LPC1700 CMSIS PIN GPIO">
      <description>LED driver for Keil MCB1700 Development Board</description>
        <files>
        <file category="source" name="Boards/Keil/MCB1700/Common/LED_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC1700 CMSIS PIN GPIO">
        <description>Buttons interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/Buttons_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.00" condition="LPC1700 CMSIS PIN GPIO">
        <description>Joystick interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/Joystick_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="LPC1700 CMSIS PIN GPIO GPDMA SPI">
        <description>Graphic LCD interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1700/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB1700/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB1700/Common/GLCD_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="SPI IF" condition="LPC1700 CMSIS PIN GPIO GPDMA SPI Display">
        <description>emWin LCD SPI Interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1700/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>
    <!-- LPC1788-32 Developers Kit -->
    <bundle Cbundle="LPC1788-32 Developers Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>Embedded Artists LPC1788-32 Developers Kit</description>
      <doc>Documents/mcb1700.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="LPC177x_8x CMSIS PIN">
        <description>A/D Converter interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/ADC_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC177x_8x CMSIS PIN I2C">
      <description>LED driver for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
        <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/LED_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC177x_8x CMSIS PIN I2C">
        <description>Buttons interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Buttons_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.00" condition="LPC177x_8x CMSIS PIN GPIO">
        <description>Joystick interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Joystick_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 800x480" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "7 inch TFT 800x480" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_800x480
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 480x272" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "4.3 inch TFT 480x272" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_480x272
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" Cvariant="TFT 320x240" condition="LPC177x_8x CMSIS PIN GPIO GPDMA SPI">
        <description>LCD Board rev PB1 "3.2 inch TFT 320x240" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_320x240
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.01" condition="LPC177x_8x CMSIS I2C SAI">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Embedded Artists/LPC1788-32 Developers Kit/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>

  </components>
</package>
